%//////////////////////////////////////////////////////////////////////////////////////
%// Лабораторная работа 3 по дисциплине ЛОИС
%// Выполнена студентом группы 721702 БГУИР Сурунтовичем Артёмом Андреевичем
%// Вариант 13
%// 	Задача решения судоку, можно на меньшем поле(4х4). Задаётся начальное состояние.
%//
:- use_module(library(clpfd)).

solve_sudoku(Matrix) :-  
  append(Matrix, Vs), Vs ins 1..9,
  maplist(all_distinct, Matrix),
  transpose(Matrix, Columns),     
  maplist(all_distinct, Columns),     
  Matrix = [A,B,C,D,E,F,G,H,I],     
  blocks(A, B, C), blocks(D, E, F), blocks(G, H, I),     
  maplist(label, Matrix).      

blocks([], [], []).       
blocks([A,B,C|Bs1], [D,E,F|Bs2], [G,H,I|Bs3]) :-     
  all_distinct([A,B,C,D,E,F,G,H,I]),      
  blocks(Bs1, Bs2, Bs3).


/** <examples>
?-   Matrix = [  
   [_,_,_,_,_,_,_,_,_],  
   [_,_,_,_,_,_,_,_,_],  
   [_,_,_,_,_,_,_,_,_],  
   [_,_,_,_,_,_,_,_,_],  
   [_,_,_,_,_,_,_,_,_],  
   [_,_,_,_,_,_,_,_,_],  
   [_,_,_,_,_,_,_,_,_],  
   [_,_,_,_,_,_,_,_,_],  
   [_,_,_,_,_,_,_,_,_]  
   ],  
solve_sudoku(Matrix).
?-   Matrix = [  
      [1,_,_,_,_,_,_,_,_],  
      [_,_,_,_,_,_,_,_,_],  
      [_,_,_,_,_,_,_,_,_],  
      [_,_,_,_,_,_,_,_,_],  
      [_,_,_,_,_,_,_,_,_],  
      [_,_,_,_,_,_,_,_,_],  
      [_,_,_,_,_,_,_,_,_],  
      [_,_,_,_,_,_,_,_,_],  
      [_,_,_,_,_,_,_,_,_]  
      ],  
   solve_sudoku(Matrix).
?-   Matrix = [  
     [_, _, 4, 2, _, 6, _, 5, _], 
          [_, _, _, _, _, 8, _, 4, 7], 
          [ _, 7, _, 4, 1, 5, 6, _, 3],  
          [_, _, _, _, _, _, 7, _, 2], 
           [3, _, 7, _, _, _, 8, _, 4], 
           [2, _, 1, _, _, _, _, _, _], 
           [6, _, 8, 3, 2, 9, _, 7, _], 
           [7, 5, _, 6, _, _, _, _, _], 
           [_, 2, _, 7, _, 1, 9, _, _] 
      ],  
   solve_sudoku(Matrix).
*/
